Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_hw_support_tle987_v1/src/Ifx_MHA_PatternGen_F16_TLE987.c
/*
 * Copyright (c) 2024 Infineon Technologies AG. All Rights Reserved.
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG, its affiliates or its licensees. If and as long as no
 * such terms of use are agreed, use of this file is subject to the Evaluation Software License Agreement distributed
 * along with this file within the software delivery package.
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/
#include "Ifx_MHA_PatternGen_F16_TLE987.h"
#include "Ifx_MHA_PatternGen_F16_TLE987_Cfg.h"

/* SDK */
#include "int.h"
#include "port.h"
#include "timer3.h"

/******************************************************************************/
/*-----------------------------------Macros-----------------------------------*/
/******************************************************************************/
/* Macros to define the component ID */
#define IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTID_SOURCEID \
    ((uint8_t)Ifx_ComponentID_SourceID_infineonTechnologiesAG)
#define IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTID_LIBRARYID \
    ((uint16_t)Ifx_ComponentID_LibraryID_mctrlHardwareAbstraction)
#define IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTID_MODULEID        (2U)
#define IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTID_COMPONENTID1    (1U)
#define IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTID_COMPONENTID2    ((uint8_t)Ifx_ComponentID_ComponentID2_basic)

/* Macros to define the component version */
#define IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTVERSION_MAJOR      (2U)
#define IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTVERSION_MINOR      (0U)
#define IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTVERSION_PATCH      (0U)
#define IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTVERSION_T          (4U)
#define IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTVERSION_REV        (0U)

/* Macro for enabling CCU6 outputs */
#define IFX_MHA_PATTERNGEN_F16_TLE987_PWM_PATTERN_SHADOW_OUT      (0x3FUL)

/* Macro for triggering T13 in T12 zero match */
#define IFX_MHA_PATTERNGEN_F16_TLE987_TRIGGER_T13_ON_ZERO_MATCH   (0x7AU)

/* Macro for triggering T13 in T12 period match */
#define IFX_MHA_PATTERNGEN_F16_TLE987_TRIGGER_T13_ON_PERIOD_MATCH (0x76U)

/* Total number of compare values */
#define IFX_MHA_PATTERNGEN_F16_TLE987_N_COMPARE_VALUES            (6U)

/* Minimum trigger time */
#define IFX_MHA_PATTERNGEN_F16_TLE987_MIN_TRIGGER_TIME            (2U)

/* Maximum supported pwm frequency for MCL on tle987x in kHz*/
#define IFX_MHA_PATTERNGEN_F16_TLE987_FREQUENCY_MAX               40U

/******************************************************************************/
/*-----------------------Static Function Prototypes---------------------------*/
/******************************************************************************/

/**
 * \brief Set CCU Trap Control register according to param fault reaction
 * Except for fault reaction is DISBALE the trap functionality block is enabled.
 * But only for fault reaction REPORT_REACT trap pin level has an impact on the CCU6 channels and trap must be cleared
 * by SW.
 *
 * \param self unused
 * \param faultReaction A value of IFX_MHA_PATTERNGEN_F16_TLE987_FAULT_REACTION_*
 */
static void Ifx_MHA_PatternGen_F16_TLE987_setFaultReactionOnTrap(Ifx_MHA_PatternGen_F16_TLE987* self, uint8_t
                                                                 faultReaction);

/**
 * \brief Check trap pin and if it is high clear the trap flag.
 * If the trap fault is disable, the trap flag does not need to be cleared.
 */
static void Ifx_MHA_PatternGen_F16_TLE987_clearTrapFlag(void);

/* Checks if any fault occurred and acts accordingly */
static inline bool Ifx_MHA_PatternGen_F16_TLE987_checkFaultStatus(Ifx_MHA_PatternGen_F16_TLE987* self, bool
                                                                  clearFault);

/* Pattern generator state machine implementation */
static inline void Ifx_MHA_PatternGen_F16_TLE987_stateMachine(Ifx_MHA_PatternGen_F16_TLE987* self, bool faultStatus,
                                                              bool clearFault);

/* Pattern generator in on state */
static inline Ifx_MHA_PatternGen_F16_TLE987_State Ifx_MHA_PatternGen_F16_TLE987_stateOn(
    Ifx_MHA_PatternGen_F16_TLE987* self, bool faultStatus);

/* Pattern generator in off state */
static inline Ifx_MHA_PatternGen_F16_TLE987_State Ifx_MHA_PatternGen_F16_TLE987_stateOff(
    Ifx_MHA_PatternGen_F16_TLE987* self, bool faultStatus);

/* Pattern generator in fault state */
static inline Ifx_MHA_PatternGen_F16_TLE987_State Ifx_MHA_PatternGen_F16_TLE987_stateFault(
    Ifx_MHA_PatternGen_F16_TLE987* self, bool faultStatus, bool clearFault);

/* Load shadow registers and request shadow transfer */
static inline void Ifx_MHA_PatternGen_F16_TLE987_transferDownCounting(Ifx_MHA_PatternGen_F16_TLE987* self);
static inline void Ifx_MHA_PatternGen_F16_TLE987_transferUpCounting(Ifx_MHA_PatternGen_F16_TLE987* self);

/* Disable and enable the pattern generator */
static inline void Ifx_MHA_PatternGen_F16_TLE987_actionDisable(void);
static inline void Ifx_MHA_PatternGen_F16_TLE987_actionEnable(void);

#if (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_CURRENT_LOOP_FACTOR > 1)

/* Update values from the shadow variables to the used ones */
static inline void Ifx_MHA_PatternGen_F16_TLE987_updateCompareAndTriggers(Ifx_MHA_PatternGen_F16_TLE987* self);
#endif

/******************************************************************************/
/*------------------------Private Variables/Constants-------------------------*/
/******************************************************************************/
/* *INDENT-OFF* */
/* Component ID */
static const Ifx_ComponentID      Ifx_MHA_PatternGen_F16_TLE987_componentID = {
    .sourceID     = IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTID_SOURCEID,
    .libraryID    = IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTID_LIBRARYID,
    .moduleID     = IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTID_MODULEID,
    .componentID1 = IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTID_COMPONENTID1,
    .componentID2 = IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTID_COMPONENTID2,
};

