Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_hw_support_tle987_v1/src/Ifx_MHA_PatternGen_F16_TLE987.c
/* Component Version */
static const Ifx_ComponentVersion Ifx_MHA_PatternGen_F16_TLE987_componentVersion = {
    .major = IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTVERSION_MAJOR,
    .minor = IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTVERSION_MINOR,
    .patch = IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTVERSION_PATCH,
    .t     = IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTVERSION_T,
    .rev   = IFX_MHA_PATTERNGEN_F16_TLE987_COMPONENTVERSION_REV
};
/* *INDENT-ON* */
/******************************************************************************/
/*-------------------------Function Implementations---------------------------*/
/******************************************************************************/
/* Function to get the component ID */
void Ifx_MHA_PatternGen_F16_TLE987_getID(const Ifx_ComponentID** componentID)
{
    *componentID = &Ifx_MHA_PatternGen_F16_TLE987_componentID;
}


/* Function to get the component version */
void Ifx_MHA_PatternGen_F16_TLE987_getVersion(const Ifx_ComponentVersion** componentVersion)
{
    *componentVersion = &Ifx_MHA_PatternGen_F16_TLE987_componentVersion;
}


void Ifx_MHA_PatternGen_F16_TLE987_init(Ifx_MHA_PatternGen_F16_TLE987* self)
{
    /* Initialize internal parameters to 0 */
    self->p_enable       = false;
    self->p_clearFault   = false;
    self->p_status.state = Ifx_MHA_PatternGen_F16_TLE987_State_init;
    self->p_status.trap  = false;

    /* Ensure that CCU6 configuration is in sync with static configuration. This is necessary in case the PatternGen
     * configuration is generated from the python parameter model respectively without Configwizard. */
    Ifx_MHA_PatternGen_F16_TLE987_setDeadTime_ns(self, IFX_MHA_PATTERNGEN_F16_TLE987_CFG_DEADTIME);
    Ifx_MHA_PatternGen_F16_TLE987_setFrequency_kHz(self, IFX_MHA_PATTERNGEN_F16_TLE987_CFG_FREQUENCY_KHZ);
    Ifx_MHA_PatternGen_F16_TLE987_setFaultReactionOnTrap(self, IFX_MHA_PATTERNGEN_F16_TLE987_CFG_FAULT_REACTION_TRAP);

    /* Reset the trigger and the compare values to be used in the interrupts */
    self->p_triggerTime_tick[0] = self->p_triggerTimeShadow_tick[0] = IFX_MHA_PATTERNGEN_F16_TLE987_MIN_TRIGGER_TIME;
    self->p_triggerTime_tick[1] = self->p_triggerTimeShadow_tick[1] = CCU6_T12_Period_Value_Get() + 1U;

    for (uint8_t i = 0U; i < IFX_MHA_PATTERNGEN_F16_TLE987_N_COMPARE_VALUES; i++)
    {
        self->p_compareValues_tick[i]       = 0U;
        self->p_compareValuesShadow_tick[i] = 0U;
    }

    /* Reset executed flag and cycle counter */
    self->p_executed     = false;
    self->p_cycleCounter = 0U;

    /* Start T13 on the period match to generate trigger for second current measurement */
    CCU6_SetT13Trigger(IFX_MHA_PATTERNGEN_F16_TLE987_TRIGGER_T13_ON_PERIOD_MATCH);
    Ifx_MHA_PatternGen_F16_TLE987_clearTrapFlag();
}


static void Ifx_MHA_PatternGen_F16_TLE987_setFaultReactionOnTrap(Ifx_MHA_PatternGen_F16_TLE987* self, uint8_t
                                                                 faultReaction)
{
    (void)self;

    switch (faultReaction)
    {
        case IFX_MHA_PATTERNGEN_F16_TLE987_FAULT_REACTION_DISABLE:
            CCU6_Trap_Channel_En(0U);
            CCU6_Trap_HW_Clr_En();
            CCU6_Trap_Pin_Dis();
            break;

        case IFX_MHA_PATTERNGEN_F16_TLE987_FAULT_REACTION_ENABLE:
            CCU6_Trap_Channel_En(0U);
            CCU6_Trap_HW_Clr_En();
            CCU6_Trap_Pin_En();
            break;

        case IFX_MHA_PATTERNGEN_F16_TLE987_FAULT_REACTION_REPORT_ONLY:
            CCU6_Trap_Channel_En(0U);
            CCU6_Trap_HW_Clr_En();
            CCU6_Trap_Pin_En();
            break;

        /* Default fault reaction is IFX_MHA_PATTERNGEN_F16_TLE987_FAULT_REACTION_REPORT_REACT */
        default:
            CCU6_Trap_Channel_En(0x3FU);
            CCU6_Trap_SW_Clr_En();
            CCU6_Trap_Pin_En();
            break;
    }
}


static void Ifx_MHA_PatternGen_F16_TLE987_clearTrapFlag(void)
{
#if IFX_MHA_PATTERNGEN_F16_TLE987_CFG_FAULT_REACTION_TRAP != 0

    /* Clear the trap interrupt flag if it is high */
    uint8_t trapPortStatus;

    /* Check which port is used for trap and get the port status */
    if (CCU6->PISEL0.bit.ISTRP == 0)
    {
        trapPortStatus = PORT_P24_Get();
    }
    else
    {
        trapPortStatus = PORT_P23_Get();
    }

    /* If the port is high, clear the trap flag */
    if (trapPortStatus != 0)
    {
        CCU6_TRAP_Int_Clr();
    }

#endif
}


void Ifx_MHA_PatternGen_F16_TLE987_execute(Ifx_MHA_PatternGen_F16_TLE987* self, uint16_t compareValues[6], uint16_t
                                           triggerTime_tick[2])
{
    /* Store clearFault variable at the beginning of the module */
    bool clearFault = self->p_clearFault;

/* If the current loop factor is 1, then don't use the shadow variables */
#if (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_CURRENT_LOOP_FACTOR == 1)

    /* Assign the trigger and the compare values to be used in the interrupts */
    self->p_triggerTime_tick[0] = triggerTime_tick[0];
    self->p_triggerTime_tick[1] = triggerTime_tick[1];

    for (uint8_t i = 0; i < IFX_MHA_PATTERNGEN_F16_TLE987_N_COMPARE_VALUES; i++)
    {
        self->p_compareValues_tick[i] = compareValues[i];
    }

#else

    /* Assign the trigger and the compare values to the shadow variables */
    self->p_triggerTimeShadow_tick[0] = triggerTime_tick[0];
    self->p_triggerTimeShadow_tick[1] = triggerTime_tick[1];

    for (uint8_t i = 0U; i < IFX_MHA_PATTERNGEN_F16_TLE987_N_COMPARE_VALUES; i++)
    {
        self->p_compareValuesShadow_tick[i] = compareValues[i];
    }

#endif

    /* Check if any fault occurred and execute state machine */
    bool faultStatusLocal = Ifx_MHA_PatternGen_F16_TLE987_checkFaultStatus(self, clearFault);
    Ifx_MHA_PatternGen_F16_TLE987_stateMachine(self, faultStatusLocal, clearFault);
}


/* Period match interrupt */
void Ifx_MHA_PatternGen_F16_TLE987_onPeriodMatch(Ifx_MHA_PatternGen_F16_TLE987* self)
{
    /* Last cycle and execute was already called, update compare values and transfer it to the CCU6 */
    if ((self->p_cycleCounter == (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_CURRENT_LOOP_FACTOR - 1))
        && (self->p_executed == true))
    {
/* Only update the values if the current loop factor is bigger than 1 */
#if (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_CURRENT_LOOP_FACTOR > 1)

        /* Update compare and trigger values */
        Ifx_MHA_PatternGen_F16_TLE987_updateCompareAndTriggers(self);
#endif

        /* Transfer compare values and reset counter and flag */
        Ifx_MHA_PatternGen_F16_TLE987_transferUpCounting(self);
    }

    /* Last cycle and PatternGen execute was not called, compare values will be updated by execute */
    else if (self->p_cycleCounter == (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_CURRENT_LOOP_FACTOR - 1))
    {
        self->p_cycleCounter++;
    }

    /* Not the last cycle, transfer current shadow values to the CCU6 */
    else
    {
        /* Transfer compare values and increment cycle counter */
        Ifx_MHA_PatternGen_F16_TLE987_transferUpCounting(self);
        self->p_cycleCounter++;
    }
}


/* One match interrupt */
void Ifx_MHA_PatternGen_F16_TLE987_onOneMatch(Ifx_MHA_PatternGen_F16_TLE987* self)
{
    /* Transfer compare values */
    Ifx_MHA_PatternGen_F16_TLE987_transferDownCounting(self);
}


static inline void Ifx_MHA_PatternGen_F16_TLE987_transferUpCounting(Ifx_MHA_PatternGen_F16_TLE987* self)
{
    /* Load shadow registers with the up counting compare values */

#if (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_INVERT_ROTATION == 1)

    /* Enable inverse rotation by swapping the compare value of phase u up-counting and phase v up-counting */
    CCU6_LoadShadowRegister_CC60(self->p_compareValues_tick[1]);
    CCU6_LoadShadowRegister_CC61(self->p_compareValues_tick[0]);
#else
    CCU6_LoadShadowRegister_CC60(self->p_compareValues_tick[0]);
    CCU6_LoadShadowRegister_CC61(self->p_compareValues_tick[1]);
#endif /* (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_INVERT_ROTATION == 1) */
    CCU6_LoadShadowRegister_CC62(self->p_compareValues_tick[2]);

    /* Load shadow register for first trigger */
    TIMER3_Set_Cmp_Value(self->p_triggerTime_tick[0] >> 1U);

    /* Enable shadow transfer */
    CCU6_T12_Str_En();
}


