Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_hw_support_tle987_v1/src/Ifx_MHA_PatternGen_F16_TLE987.c
static inline void Ifx_MHA_PatternGen_F16_TLE987_transferDownCounting(Ifx_MHA_PatternGen_F16_TLE987* self)
{
    /* Store T12 period value */
    uint16 periodValue = CCU6_T12_Period_Value_Get() + 1;
    uint16 timerPeriod = 2U * periodValue;

    /* Load shadow registers with the down counting compare values */
#if (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_INVERT_ROTATION == 1)

    /* Enable inverse rotation by swapping the compare value of phase u down-counting and v down-counting */
    CCU6_LoadShadowRegister_CC60(timerPeriod - self->p_compareValues_tick[4]);
    CCU6_LoadShadowRegister_CC61(timerPeriod - self->p_compareValues_tick[3]);
#else
    CCU6_LoadShadowRegister_CC60(timerPeriod - self->p_compareValues_tick[3]);
    CCU6_LoadShadowRegister_CC61(timerPeriod - self->p_compareValues_tick[4]);
#endif /* (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_INVERT_ROTATION == 1) */
    CCU6_LoadShadowRegister_CC62(timerPeriod - self->p_compareValues_tick[5]);

    /* Load shadow register for second trigger */
    CCU6_LoadShadowRegister_CC63(self->p_triggerTime_tick[1] - periodValue);

    /* Enable shadow transfer */
    CCU6_T12_Str_En();
    CCU6_T13_Str_En();
}


#if (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_CURRENT_LOOP_FACTOR > 1)
static inline void Ifx_MHA_PatternGen_F16_TLE987_updateCompareAndTriggers(Ifx_MHA_PatternGen_F16_TLE987* self)
{
    /* Update compare values */
    self->p_triggerTime_tick[0] = self->p_triggerTimeShadow_tick[0];
    self->p_triggerTime_tick[1] = self->p_triggerTimeShadow_tick[1];

    for (uint8_t i = 0U; i < IFX_MHA_PATTERNGEN_F16_TLE987_N_COMPARE_VALUES; i++)
    {
        self->p_compareValues_tick[i] = self->p_compareValuesShadow_tick[i];
    }
}


#endif

static inline Ifx_MHA_PatternGen_F16_TLE987_State Ifx_MHA_PatternGen_F16_TLE987_stateOn(
    Ifx_MHA_PatternGen_F16_TLE987* self, bool faultStatus)
{
    /* Variable to store the next state */
    Ifx_MHA_PatternGen_F16_TLE987_State nextState;

    if (faultStatus == true)
    {
        /* Set the state to fault */
        nextState = Ifx_MHA_PatternGen_F16_TLE987_State_fault;
    }

    /* Check if module disabled */
    else if (self->p_enable == false)
    {
        /* Set the state to OFF */
        nextState = Ifx_MHA_PatternGen_F16_TLE987_State_off;

        /* Disable the pattern generator */
        Ifx_MHA_PatternGen_F16_TLE987_actionDisable();
    }
    else
    {
        /* Disable CCU6 SR1 node */
        NVIC_Node5_Dis();

        /* Transfer values if the last period match was already executed */
        if (self->p_cycleCounter == IFX_MHA_PATTERNGEN_F16_TLE987_CFG_CURRENT_LOOP_FACTOR)
        {
#if (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_CURRENT_LOOP_FACTOR > 1)

            /* Update compare and trigger values and transfer them to CCU6 */
            Ifx_MHA_PatternGen_F16_TLE987_updateCompareAndTriggers(self);
#endif
            Ifx_MHA_PatternGen_F16_TLE987_transferUpCounting(self);
        }
        else
        {
            /* Signal to the period match function that this function was executed */
            self->p_executed = true;
        }

        nextState = Ifx_MHA_PatternGen_F16_TLE987_State_on;

        /* Enable CCU6 SR1 node */
        NVIC_Node5_En();
    }

    return nextState;
}


static inline Ifx_MHA_PatternGen_F16_TLE987_State Ifx_MHA_PatternGen_F16_TLE987_stateOff(
    Ifx_MHA_PatternGen_F16_TLE987* self, bool faultStatus)
{
    /* Variable to store the next state */
    Ifx_MHA_PatternGen_F16_TLE987_State nextState;

    /* Check if any fault occurred */
    if (faultStatus == true)
    {
        /* Set the state to fault */
        nextState = Ifx_MHA_PatternGen_F16_TLE987_State_fault;
    }

    /* Check if module enabled */
    else if (self->p_enable == true)
    {
        /* Transition to ON if module enabled on the next execution cycle */
        nextState = Ifx_MHA_PatternGen_F16_TLE987_State_on;

        /* Enable the pattern generator */
        Ifx_MHA_PatternGen_F16_TLE987_actionEnable();
    }
    else
    {
        nextState = Ifx_MHA_PatternGen_F16_TLE987_State_off;
    }

    return nextState;
}


static inline Ifx_MHA_PatternGen_F16_TLE987_State Ifx_MHA_PatternGen_F16_TLE987_stateFault(
    Ifx_MHA_PatternGen_F16_TLE987* self, bool faultStatus, bool clearFault)
{
    (void)self;

    /* Variable to store the next state */
    Ifx_MHA_PatternGen_F16_TLE987_State nextState;

    if ((faultStatus == false)
        && (clearFault == true))
    {
        /* Transition to off if module is in fault in the next execution cycle */
        nextState = Ifx_MHA_PatternGen_F16_TLE987_State_off;

        /* Disable the pattern generator*/
        Ifx_MHA_PatternGen_F16_TLE987_actionDisable();
    }
    else
    {
        nextState = Ifx_MHA_PatternGen_F16_TLE987_State_fault;
    }

    return nextState;
}


static inline void Ifx_MHA_PatternGen_F16_TLE987_stateMachine(Ifx_MHA_PatternGen_F16_TLE987* self, bool faultStatus,
                                                              bool clearFault)
{
    /* Variable to store the state */
    Ifx_MHA_PatternGen_F16_TLE987_State previousState = self->p_status.state;
    Ifx_MHA_PatternGen_F16_TLE987_State nextState     = previousState;

    switch (previousState)
    {
        /* Initialize the module */
        case Ifx_MHA_PatternGen_F16_TLE987_State_init:

            /* Set the state to OFF */
            nextState = Ifx_MHA_PatternGen_F16_TLE987_State_off;
            break;

        /* Pattern generator is running */
        case Ifx_MHA_PatternGen_F16_TLE987_State_on:
            nextState = Ifx_MHA_PatternGen_F16_TLE987_stateOn(self, faultStatus);
            break;

        /* Pattern generator not running */
        case Ifx_MHA_PatternGen_F16_TLE987_State_off:
            nextState = Ifx_MHA_PatternGen_F16_TLE987_stateOff(self, faultStatus);
            break;

        /* Pattern generator is in fault */
        case Ifx_MHA_PatternGen_F16_TLE987_State_fault:
            nextState = Ifx_MHA_PatternGen_F16_TLE987_stateFault(self, faultStatus, clearFault);
            break;

        default:

            /* do default transition to INIT */
            nextState = Ifx_MHA_PatternGen_F16_TLE987_State_init;
            break;
    }

