Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_hw_support_tle987_v1/src/Ifx_MHA_PatternGen_F16_TLE987.c
    self->p_status.state = nextState;

    /* Clear the internal variable */
    if (clearFault == true)
    {
        self->p_clearFault = false;
    }
}


static inline bool Ifx_MHA_PatternGen_F16_TLE987_checkFaultStatus(Ifx_MHA_PatternGen_F16_TLE987* self, bool
                                                                  clearFault)
{
    /* boolean output fault status initialized to false */
    bool faultStatusRet = false;

    /* local copy of the previously detected faults */
    bool faultTrap = self->p_status.trap;

    /* first check if a fault clear request was placed */
    if (clearFault == true)
    {
        /* Clear the trap fault in case a fault clear request was done */
        faultTrap = false;

        /* Clear the trap flag */
        CCU6_TRAP_Int_Clr();
    }

    /* Check if the trap fault is enabled */
#if IFX_MHA_PATTERNGEN_F16_TLE987_CFG_FAULT_REACTION_TRAP >= IFX_MHA_PATTERNGEN_F16_TLE987_FAULT_REACTION_ENABLE

    /* Read the status bits for trap fault from pattern generator Interrupt Status register */
    if (CCU6_Trap_Flag_Int_Sts() != 0)
    {
        /* set the trap fault information status bit */
        faultTrap = true;

        /* Check if this fault is configured for REPORTING */
#if IFX_MHA_PATTERNGEN_F16_TLE987_CFG_FAULT_REACTION_TRAP >= IFX_MHA_PATTERNGEN_F16_TLE987_FAULT_REACTION_REPORT_ONLY

#if (IFX_MHA_PATTERNGEN_F16_TLE987_CFG_ENABLE_FAULT_OUT == 1)

        /* report fault source ONLY the first time it occurs */
        if (self->p_status.trap == false)
        {
            /* report the fault through the user interface */
            IFX_MHA_PATTERNGEN_F16_TLE987_CFG_FAULT_OUT();
        }

#endif

        /* Check if this fault is configured for REACTION */
#if IFX_MHA_PATTERNGEN_F16_TLE987_CFG_FAULT_REACTION_TRAP >= IFX_MHA_PATTERNGEN_F16_TLE987_FAULT_REACTION_REPORT_REACT

        /* set the fault status for reacting */
        faultStatusRet = true;
#endif
#endif
    }

#endif

    self->p_status.trap = faultTrap;

    return faultStatusRet;
}


static inline void Ifx_MHA_PatternGen_F16_TLE987_actionDisable(void)
{
    /* Sets Multi-Channel PWM Pattern shadow register */
    CCU6_Multi_Ch_PWM_Shadow_Reg_Load((uint16_t)0x0000U);

    /* Enables shadow transfer request by software */
    CCU6_MCM_PWM_Str_SW_En();
}


static inline void Ifx_MHA_PatternGen_F16_TLE987_actionEnable(void)
{
    /* Sets Multi-Channel PWM Pattern shadow register */
    CCU6_Multi_Ch_PWM_Shadow_Reg_Load((uint16_t)IFX_MHA_PATTERNGEN_F16_TLE987_PWM_PATTERN_SHADOW_OUT);

    /* Enables shadow transfer request by software*/
    CCU6_MCM_PWM_Str_SW_En();
}


void Ifx_MHA_PatternGen_F16_TLE987_setDeadTime_ns(Ifx_MHA_PatternGen_F16_TLE987* self, uint32_t deadTime_ns)
{
    (void)self;

    /* Local variables for dead time ticks and dead time */
    uint32_t deadTimeSet_tick;
    uint32_t newDeadtime = deadTime_ns;

#if IFX_MHA_PATTERNGEN_F16_TLE987_CFG_MIN_DEADTIME > 0

    /* Check if input dead time is less than the minimum dead time */
    if (deadTime_ns < IFX_MHA_PATTERNGEN_F16_TLE987_CFG_MIN_DEADTIME)
    {
        newDeadtime = IFX_MHA_PATTERNGEN_F16_TLE987_CFG_MIN_DEADTIME;
    }

#endif

    /* Conversion of dead time into dead time ticks for center aligned mode */
    deadTimeSet_tick = ((newDeadtime) * CCU6_T12_CLK) / (IFX_MHA_PATTERNGEN_F16_TLE987_NANO_TO_MICRO);

    /* Setting up dead time in ticks using CCU6 function */
    CCU6_Deadtime_Set((uint16)deadTimeSet_tick);
}


uint32_t Ifx_MHA_PatternGen_F16_TLE987_getDeadTime_ns(Ifx_MHA_PatternGen_F16_TLE987* self)
{
    (void)self;

    /* Local variable for dead time*/
    uint32_t deadTimeGet;

    /* Conversion of dead time ticks into dead time for center align mode */
    deadTimeGet = ((uint32_t)CCU6_Deadtime_Get() * IFX_MHA_PATTERNGEN_F16_TLE987_NANO_TO_MICRO);
    deadTimeGet = deadTimeGet / (CCU6_T12_CLK);

    return deadTimeGet;
}


void Ifx_MHA_PatternGen_F16_TLE987_setFrequency_kHz(Ifx_MHA_PatternGen_F16_TLE987* self, uint32_t frequency_kHz)
{
    uint32_t period_tick;

    if ((self->p_status.state == Ifx_MHA_PatternGen_F16_TLE987_State_off)
        || (self->p_status.state == Ifx_MHA_PatternGen_F16_TLE987_State_init))
    {
        /* Check if frequency is greater than MAX  */
        if (frequency_kHz > IFX_MHA_PATTERNGEN_F16_TLE987_FREQUENCY_MAX)
        {
            frequency_kHz = IFX_MHA_PATTERNGEN_F16_TLE987_FREQUENCY_MAX;
        }

        /* Conversion of frequency into period ticks for center align mode */
        period_tick = ((CCU6_T12_CLK * IFX_MHA_PATTERNGEN_F16_TLE987_MHZ_TO_KHZ) / (frequency_kHz));
        period_tick = (period_tick / (2U)) - 1U;

        /* Setting up period ticks using CCU6 function */
        CCU6_T12_Period_Value_Set((uint16)period_tick);

        /* The period of T13 should be period of T12 -1. The -1 is to allow the timer to start again
         * There is a period match on T13 1 cycle before a period match in T12, and T13 start is triggered again by T12
         * period match.
         */
        CCU6_LoadPeriodRegister_T13_Tick((uint16)period_tick - 1U);
    }
    else
    {
        /* ignore set value */
    }
}


uint32_t Ifx_MHA_PatternGen_F16_TLE987_getFrequency_kHz(Ifx_MHA_PatternGen_F16_TLE987* self)
{
    (void)self;

    /* Local variable for frequency*/
    uint32_t frequencyTemp;

    /* Conversion of period ticks into frequency for center align mode */
    frequencyTemp = ((CCU6_T12_CLK * IFX_MHA_PATTERNGEN_F16_TLE987_MHZ_TO_KHZ) /
                     ((uint32_t)CCU6_T12_Period_Value_Get() + 1U));
    frequencyTemp = frequencyTemp / (2U);

    return frequencyTemp;
}
